In [219]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

from pathlib import Path
from sqlalchemy import create_engine
from ds100_utils import fetch_and_cache

In [220]:
import sqlite3
conn = sqlite3.connect('testsql.db')

In [221]:
conn.executescript("""
DROP TABLE IF EXISTS foods;
DROP TABLE IF EXISTS countersales;

CREATE TABLE foods(
    id INTEGER PRIMARY KEY, 
    name TEXT
);

INSERT INTO foods VALUES 
    (-1, 'Apricot'),
    (1, 'Boots'),
    (2, 'Cally'),
    (4, 'Eugene');

CREATE TABLE countersales(
    id INTEGER PRIMARY KEY,
    breed TEXT
);

INSERT INTO countersales VALUES 
    (1, 'persian'),
    (2, 'ragdoll'),
    (4, 'bengal'),
    (5, 'persian');
""");

In [222]:
def print_sql(s):
    for result in conn.execute(s):
        print(result)

print("foods")
print_sql('SELECT * FROM foods;')
print("countersales")
print_sql('SELECT * FROM countersales;')

foods
(-1, 'Apricot')
(1, 'Boots')
(2, 'Cally')
(4, 'Eugene')
countersales
(1, 'persian')
(2, 'ragdoll')
(4, 'bengal')
(5, 'persian')

In [223]:
#left outer join
query = '''
SELECT *
FROM foods a LEFT JOIN countersales b
  ON a.id = b.id where a.id > 3
'''
print_sql(query)

(4, 'Eugene', 4, 'bengal')

In [224]:

dropIfExists = '''
DROP TABLE IF EXISTS Customers1;
'''


print_sql(dropIfExists)

In [225]:
createTable = '''
CREATE TABLE Customers1(
    id INTEGER PRIMARY KEY, 
    firstname TEXT,
    lastname TEXT,
    age INTEGER,
    country TEXT
);
'''
print_sql(createTable)

In [226]:
query = "PRAGMA table_info(Customers1);"
print_sql(query)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'firstname', 'TEXT', 0, None, 0)
(2, 'lastname', 'TEXT', 0, None, 0)
(3, 'age', 'INTEGER', 0, None, 0)
(4, 'country', 'TEXT', 0, None, 0)

In [227]:

insertStatement2 = '''
INSERT INTO Customers1 VALUES 
    (0, 'John', 'Kim', 31, 'USA'),
    (1, 'James', 'Kang', 22, 'USA'),
    (2, 'David', 'Robinson', 22, 'UK'),
    (4, 'Sam', 'Jones', 25, 'UK'),
    (5, 'Bill', 'Smith', 28, 'UAE');
'''

print_sql(insertStatement2)

In [228]:
querycustomer = '''
SELECT *
FROM Customers1
'''
print_sql(querycustomer)

(0, 'John', 'Kim', 31, 'USA')
(1, 'James', 'Kang', 22, 'USA')
(2, 'David', 'Robinson', 22, 'UK')
(4, 'Sam', 'Jones', 25, 'UK')
(5, 'Bill', 'Smith', 28, 'UAE')

In [229]:
querygroupbyhaving = '''
SELECT country, AVG(age) as average_age
FROM Customers1
GROUP BY country
HAVING AVG(age) > 25;
'''
print_sql(querygroupbyhaving)

('UAE', 28.0)
('USA', 26.5)

In [230]:
createStudent = '''
CREATE TABLE students (
    name TEXT,
    gpa REAL,
    age INTEGER,
    dept TEXT,
    gender TEXT
);
'''
print_sql(createStudent)

In [231]:
insertStudents = '''
INSERT INTO students (name, gpa, age, dept, gender) VALUES
('Sergey Brin', 2.8, 45, 'CS', 'M'),
('Danah Boyd', 3.9, 40, 'CS', 'F'),
('Bill Gates', 1, 63, 'CS', 'M'),
('Hillary Mason', 4, 39, 'DATASCI', 'F'),
('Mike Olson', 3.7, 53, 'CS', 'M'),
('Mark Zuckerberg', 3.8, 34, 'CS', 'M'),
('Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F'),
('Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F'),
('Marissa Mayer', 2.6, 43, 'BUSINESS', 'F');
'''

print_sql(insertStudents)

In [232]:
queryStudents = '''
SELECT *
FROM students
'''
print_sql(queryStudents)

('Sergey Brin', 2.8, 45, 'CS', 'M')
('Danah Boyd', 3.9, 40, 'CS', 'F')
('Bill Gates', 1.0, 63, 'CS', 'M')
('Hillary Mason', 4.0, 39, 'DATASCI', 'F')
('Mike Olson', 3.7, 53, 'CS', 'M')
('Mark Zuckerberg', 3.8, 34, 'CS', 'M')
('Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
('Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
('Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')

In [233]:
queryStudents = '''
SELECT DISTINCT dept from students;
'''
print_sql(queryStudents)

('CS',)
('DATASCI',)
('BUSINESS',)

In [234]:
queryStudents = '''
SELECT COUNT(DISTINCT dept) from students;
'''
print_sql(queryStudents)

(3,)

Doing Joins

In [235]:
createleft = '''
CREATE TABLE s (
    id INTEGER PRIMARY KEY,
    name TEXT
);
'''
print_sql(createleft)

In [236]:
createright = '''
CREATE TABLE t (
    id INTEGER PRIMARY KEY,
    breed TEXT
);
'''
print_sql(createright)

In [237]:
insertleft = '''
INSERT INTO s (id, name) VALUES
(0, 'Apricot'),
(1, 'Boots'),
(2, 'Cally'),
(4, 'Eugene');
'''

print_sql(insertleft)

In [238]:
insertleft = '''
INSERT INTO t (id, breed) VALUES
(1, 'persian'),
(2, 'ragdoll'),
(4, 'bengal'),
(5, 'persian');
'''

print_sql(insertleft)

In [239]:
justLeft = '''
SELECT * FROM s;
'''
print_sql(justLeft)

(0, 'Apricot')
(1, 'Boots')
(2, 'Cally')
(4, 'Eugene')

In [240]:
justRight = '''
SELECT * FROM t;
'''
print_sql(justRight)

(1, 'persian')
(2, 'ragdoll')
(4, 'bengal')
(5, 'persian')

In [241]:
crossJoin = '''
SELECT * FROM s, t;
'''
print_sql(crossJoin)

(0, 'Apricot', 1, 'persian')
(0, 'Apricot', 2, 'ragdoll')
(0, 'Apricot', 4, 'bengal')
(0, 'Apricot', 5, 'persian')
(1, 'Boots', 1, 'persian')
(1, 'Boots', 2, 'ragdoll')
(1, 'Boots', 4, 'bengal')
(1, 'Boots', 5, 'persian')
(2, 'Cally', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(2, 'Cally', 4, 'bengal')
(2, 'Cally', 5, 'persian')
(4, 'Eugene', 1, 'persian')
(4, 'Eugene', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')
(4, 'Eugene', 5, 'persian')

The inner join is the intersection.  Here are three permutations of them.

In [242]:
innerJoin = '''
SELECT * FROM s JOIN t ON s.id = t.id;
'''
print_sql(innerJoin)

(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')

In [243]:
innerJoin = '''
SELECT * FROM s INNER JOIN t ON s.id = t.id;
'''
print_sql(innerJoin)

(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')

In [244]:
innerJoin = '''
SELECT * FROM s, t WHERE s.id = t.id;
'''
print_sql(innerJoin)

(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')

In [245]:
leftOuterJoin = '''
SELECT * FROM s LEFT JOIN t ON s.id = t.id;
'''
print_sql(leftOuterJoin)

(0, 'Apricot', None, None)
(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')

In [246]:
rightOuterJoin = '''
SELECT * FROM s RIGHT JOIN t ON s.id = t.id;
'''
print_sql(rightOuterJoin)

(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')
(None, None, 5, 'persian')

In [247]:
fullOuterJoin = '''
SELECT * FROM s FULL OUTER JOIN t ON s.id = t.id;
'''
print_sql(fullOuterJoin)

(0, 'Apricot', None, None)
(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')
(None, None, 5, 'persian')

In [248]:
createTeacher = '''
CREATE TABLE teacher (
    age INTEGER,
    name TEXT
);
'''
print_sql(createTeacher)

In [249]:
insertTeachers = '''
INSERT INTO teacher (age, name) VALUES
(52, 'Ian'),
(41, 'Hell'),
(27, 'John'),
(36, 'Anne');
'''
print_sql(insertTeachers)

In [250]:
verifyTeachers = '''
SELECT * from teacher;
'''
print_sql(verifyTeachers)

(52, 'Ian')
(41, 'Hell')
(27, 'John')
(36, 'Anne')

In [251]:
weirdQuery = '''
SELECT s.name, t.name FROM students s, teacher t WHERE s.age > t.age;
'''
print_sql(weirdQuery)

('Sergey Brin', 'Hell')
('Sergey Brin', 'John')
('Sergey Brin', 'Anne')
('Danah Boyd', 'John')
('Danah Boyd', 'Anne')
('Bill Gates', 'Ian')
('Bill Gates', 'Hell')
('Bill Gates', 'John')
('Bill Gates', 'Anne')
('Hillary Mason', 'John')
('Hillary Mason', 'Anne')
('Mike Olson', 'Ian')
('Mike Olson', 'Hell')
('Mike Olson', 'John')
('Mike Olson', 'Anne')
('Mark Zuckerberg', 'John')
('Sheryl Sandberg', 'Hell')
('Sheryl Sandberg', 'John')
('Sheryl Sandberg', 'Anne')
('Susan Wojcicki', 'Hell')
('Susan Wojcicki', 'John')
('Susan Wojcicki', 'Anne')
('Marissa Mayer', 'Hell')
('Marissa Mayer', 'John')
('Marissa Mayer', 'Anne')

Aggregation

In [252]:
straightQuery = '''
SELECT * FROM s LEFT JOIN t ON s.id = t.id;
'''
print_sql(straightQuery)

(0, 'Apricot', None, None)
(1, 'Boots', 1, 'persian')
(2, 'Cally', 2, 'ragdoll')
(4, 'Eugene', 4, 'bengal')

The  bellow query ignored the null

In [253]:
aggregateCount = '''
SELECT COUNT(t.id) FROM s LEFT JOIN t ON s.id = t.id;
'''
print_sql(aggregateCount)

(3,)

This above returned the number of rows in the resulting join.

In [254]:
aggSum = '''
SELECT SUM(t.id) FROM s LEFT JOIN t ON s.id = t.id;
'''
print_sql(aggSum)

(7,)

In [255]:
aggAvg = '''
SELECT AVG(t.id) FROM s LEFT JOIN t ON s.id = t.id;
'''
print_sql(aggAvg)

(2.3333333333333335,)

This is 7/3 not 7/4

In [256]:
createMovie = '''
CREATE TABLE movies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    year INTEGER,
    genre TEXT,
    title TEXT,
    main_actor TEXT,
    director TEXT
);
'''
print_sql(createMovie)

In [257]:
insertMovie = '''
INSERT INTO movies (year, genre, title, main_actor, director) VALUES
(1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont'),
(1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola'),
(2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan'),
(1994, 'Drama', 'Forrest Gump', 'Tom Hanks', 'Robert Zemeckis'),
(1999, 'Sci-Fi', 'The Matrix', 'Keanu Reeves', 'Lana Wachowski'),
(1994, 'Crime', 'Pulp Fiction', 'John Travolta', 'Quentin Tarantino'),
(2003, 'Fantasy', 'The Lord of the Rings: The Return of the King', 'Elijah Wood', 'Peter Jackson'),
(1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher'),
(1994, 'Drama', 'The Lion King', 'Matthew Broderick', 'Roger Allers'),
(2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan'),
(1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron'),
(1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner'),
(1995, 'Animation', 'Toy Story', 'Tom Hanks', 'John Lasseter'),
(2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus'),
(1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg'),
(1985, 'Adventure', 'Back to the Future', 'Michael J. Fox', 'Robert Zemeckis'),
(2002, 'Action', 'Spider-Man', 'Tobey Maguire', 'Sam Raimi'),
(2012, 'Action', 'The Avengers', 'Robert Downey Jr.', 'Joss Whedon'),
(1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme'),
(2000, 'Action', 'Gladiator', 'Russell Crowe', 'Ridley Scott');
'''
print_sql(insertMovie)

In [258]:
randomSample = '''
SELECT * FROM movies ORDER BY RANDOM() LIMIT 3
'''
print_sql(randomSample)

(5, 1999, 'Sci-Fi', 'The Matrix', 'Keanu Reeves', 'Lana Wachowski')
(17, 2002, 'Action', 'Spider-Man', 'Tobey Maguire', 'Sam Raimi')
(13, 1995, 'Animation', 'Toy Story', 'Tom Hanks', 'John Lasseter')

In [259]:
randomSample = '''
SELECT year FROM movies
GROUP BY year
ORDER BY RANDOM()
LIMIT 3;
'''
print_sql(randomSample)

(2003,)
(2001,)
(2010,)

In [260]:
randomSample = '''
SELECT * FROM movies
WHERE year IN (
SELECT year FROM movies
group by year
order by RANDOM()
limit 3
);
'''
print_sql(randomSample)

(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron')
(17, 2002, 'Action', 'Spider-Man', 'Tobey Maguire', 'Sam Raimi')

In [261]:
randomSample = '''

WITH t2 AS (
SELECT * FROM movies ORDER BY RANDOM() LIMIT 10
)
SELECT * FROM t2, students;

'''
print_sql(randomSample)

(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Bill Gates', 1.0, 63, 'CS', 'M')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Mike Olson', 3.7, 53, 'CS', 'M')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(15, 1993, 'Adventure', 'Jurassic Park', 'Sam Neill', 'Steven Spielberg', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Bill Gates', 1.0, 63, 'CS', 'M')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Mike Olson', 3.7, 53, 'CS', 'M')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(8, 1999, 'Drama', 'Fight Club', 'Brad Pitt', 'David Fincher', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Bill Gates', 1.0, 63, 'CS', 'M')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Mike Olson', 3.7, 53, 'CS', 'M')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(2, 1972, 'Crime', 'The Godfather', 'Marlon Brando', 'Francis Ford Coppola', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Bill Gates', 1.0, 63, 'CS', 'M')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Mike Olson', 3.7, 53, 'CS', 'M')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(10, 2010, 'Sci-Fi', 'Inception', 'Leonardo DiCaprio', 'Christopher Nolan', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Bill Gates', 1.0, 63, 'CS', 'M')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Mike Olson', 3.7, 53, 'CS', 'M')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(14, 2001, 'Fantasy', 'Harry Potter and the Sorcerers Stone', 'Daniel Radcliffe', 'Chris Columbus', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Bill Gates', 1.0, 63, 'CS', 'M')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Mike Olson', 3.7, 53, 'CS', 'M')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(1, 1994, 'Drama', 'The Shawshank Redemption', 'Tim Robbins', 'Frank Darabont', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Bill Gates', 1.0, 63, 'CS', 'M')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Mike Olson', 3.7, 53, 'CS', 'M')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(12, 1980, 'Sci-Fi', 'Star Wars: Episode V - The Empire Strikes Back', 'Mark Hamill', 'Irvin Kershner', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Bill Gates', 1.0, 63, 'CS', 'M')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Mike Olson', 3.7, 53, 'CS', 'M')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(11, 1997, 'Romance', 'Titanic', 'Leonardo DiCaprio', 'James Cameron', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Bill Gates', 1.0, 63, 'CS', 'M')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Mike Olson', 3.7, 53, 'CS', 'M')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(19, 1991, 'Thriller', 'The Silence of the Lambs', 'Jodie Foster', 'Jonathan Demme', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Sergey Brin', 2.8, 45, 'CS', 'M')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Danah Boyd', 3.9, 40, 'CS', 'F')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Bill Gates', 1.0, 63, 'CS', 'M')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Hillary Mason', 4.0, 39, 'DATASCI', 'F')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Mike Olson', 3.7, 53, 'CS', 'M')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Mark Zuckerberg', 3.8, 34, 'CS', 'M')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Sheryl Sandberg', 3.6, 49, 'BUSINESS', 'F')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Susan Wojcicki', 3.8, 50, 'BUSINESS', 'F')
(3, 2008, 'Action', 'The Dark Knight', 'Christian Bale', 'Christopher Nolan', 'Marissa Mayer', 2.6, 43, 'BUSINESS', 'F')

In [262]:
caseSample = '''
SELECT 
    id,
    title,
    year,
    genre,
    main_actor,
    director,
    CASE
        WHEN year < 2000 THEN 'Classic'
        WHEN year BETWEEN 2000 AND 2010 THEN 'Modern Classic'
        ELSE 'Contemporary'
    END AS era
FROM 
    movies;

'''
print_sql(caseSample)

(1, 'The Shawshank Redemption', 1994, 'Drama', 'Tim Robbins', 'Frank Darabont', 'Classic')
(2, 'The Godfather', 1972, 'Crime', 'Marlon Brando', 'Francis Ford Coppola', 'Classic')
(3, 'The Dark Knight', 2008, 'Action', 'Christian Bale', 'Christopher Nolan', 'Modern Classic')
(4, 'Forrest Gump', 1994, 'Drama', 'Tom Hanks', 'Robert Zemeckis', 'Classic')
(5, 'The Matrix', 1999, 'Sci-Fi', 'Keanu Reeves', 'Lana Wachowski', 'Classic')
(6, 'Pulp Fiction', 1994, 'Crime', 'John Travolta', 'Quentin Tarantino', 'Classic')
(7, 'The Lord of the Rings: The Return of the King', 2003, 'Fantasy', 'Elijah Wood', 'Peter Jackson', 'Modern Classic')
(8, 'Fight Club', 1999, 'Drama', 'Brad Pitt', 'David Fincher', 'Classic')
(9, 'The Lion King', 1994, 'Drama', 'Matthew Broderick', 'Roger Allers', 'Classic')
(10, 'Inception', 2010, 'Sci-Fi', 'Leonardo DiCaprio', 'Christopher Nolan', 'Modern Classic')
(11, 'Titanic', 1997, 'Romance', 'Leonardo DiCaprio', 'James Cameron', 'Classic')
(12, 'Star Wars: Episode V - The Empire Strikes Back', 1980, 'Sci-Fi', 'Mark Hamill', 'Irvin Kershner', 'Classic')
(13, 'Toy Story', 1995, 'Animation', 'Tom Hanks', 'John Lasseter', 'Classic')
(14, 'Harry Potter and the Sorcerers Stone', 2001, 'Fantasy', 'Daniel Radcliffe', 'Chris Columbus', 'Modern Classic')
(15, 'Jurassic Park', 1993, 'Adventure', 'Sam Neill', 'Steven Spielberg', 'Classic')
(16, 'Back to the Future', 1985, 'Adventure', 'Michael J. Fox', 'Robert Zemeckis', 'Classic')
(17, 'Spider-Man', 2002, 'Action', 'Tobey Maguire', 'Sam Raimi', 'Modern Classic')
(18, 'The Avengers', 2012, 'Action', 'Robert Downey Jr.', 'Joss Whedon', 'Contemporary')
(19, 'The Silence of the Lambs', 1991, 'Thriller', 'Jodie Foster', 'Jonathan Demme', 'Classic')
(20, 'Gladiator', 2000, 'Action', 'Russell Crowe', 'Ridley Scott', 'Modern Classic')

In [263]:
substrSample = '''

SELECT 
    
    title,
    SUBSTR(title, 1, INSTR(title || ' ', ' ') - 1) AS first_word
FROM 
    movies;

'''
print_sql(substrSample)

('The Shawshank Redemption', 'The')
('The Godfather', 'The')
('The Dark Knight', 'The')
('Forrest Gump', 'Forrest')
('The Matrix', 'The')
('Pulp Fiction', 'Pulp')
('The Lord of the Rings: The Return of the King', 'The')
('Fight Club', 'Fight')
('The Lion King', 'The')
('Inception', 'Inception')
('Titanic', 'Titanic')
('Star Wars: Episode V - The Empire Strikes Back', 'Star')
('Toy Story', 'Toy')
('Harry Potter and the Sorcerers Stone', 'Harry')
('Jurassic Park', 'Jurassic')
('Back to the Future', 'Back')
('Spider-Man', 'Spider-Man')
('The Avengers', 'The')
('The Silence of the Lambs', 'The')
('Gladiator', 'Gladiator')